#pragma once
#include "system/json.hpp"

#define ROBOT_ALMIGHTY     //全能机
#define READ_SD_CARD false //是否从SD卡上读取 false 从这里读取参数 true 从SD卡上读取参数
const std::string userConfig = R"({
    "json版本号:": 1.0,
    "系统信息": {
        "机器人类型": "全能机",
        "队伍编号": "7671D",
        "用户": "bear",
        "机器人长度": 457,
        "机器人宽度": 365,
        "赛场边长": 3396,
        "轮间距": 300.0,
        "车轮直径": 4.00
    },
    "视觉信息": {
        "视觉传感器前": 11,
        "最大识别高": 75,
        "最大识别宽": 65
    },
    "底盘": {
        "马达": [
            {
                "名字": "左前",
                "端口": 1,
                "正反": 0,
                "齿轮": 1
            },
            {
                "名字": "左后",
                "端口": 2,
                "正反": 1,
                "齿轮": 1
            },
            {
                "名字": "右前",
                "端口": 3,
                "正反": 1,
                "齿轮": 1
            },
            {
                "名字": "右后",
                "端口": 4,
                "正反": 0,
                "齿轮": 1
            }
        ],
        "ADI": {
            "陀螺仪": 1
        },
        "参数": {
            "陀螺仪比例": 0.94,
            "左右矫正比例": 1.1,
            "左右自瞄速度": 30,
            "遥控器矫正": 10,
            "最大旋转速度": 127
        },
        "PID参数": {
            "前后pid": [
                {
                    "KP": 0.6
                },
                {
                    "KI": 0.005
                },
                {
                    "KD": 1.0005
                },
                {
                    "KBIAS": 0
                },
                {
                    "LIMIT": 100
                },
                {
                    "Q": 0.01
                },
                {
                    "R": 0.02
                }
            ],
            "左右pid": [
                {
                    "KP": 3.0
                },
                {
                    "KI": 0.0505
                },
                {
                    "KD": 22.229
                },
                {
                    "BIAS": 0
                },
                {
                    "LIMIT": 40
                },
                {
                    "Q": 0.01
                },
                {
                    "R": 0.02
                }
            ]
        }
    },
    "弹射": {
        "马达": [
            {
                "名字": "弹射",
                "端口": 5,
                "正反": 0,
                "齿轮": 0
            }
        ],
        "ADI": {
            "弹射碰撞": 2,
            "弹射角感": 3
        },
        "参数": {
            "悬停值": 15,
            "准备值": 400,
            "发射值": 440
        }
    },
    "吸吐": {
        "马达": [
            {
                "名字": "吸吐",
                "端口": 7,
                "正反": 1,
                "齿轮": 1
            }
        ],
        "ADI": {
            "弹射巡线": 4,
            "吸吐巡线": 5
        },
        "参数": {
            "悬停值": 3,
            "吸吐巡线值": 300,
            "弹射巡线值": 1000
        }
    },
    "升降": {
        "马达": [
            {
                "名字": "升降",
                "端口": 6,
                "正反": 0,
                "齿轮": 1
            }
        ],
        "参数": {
            "悬停值": 10,
            "升到顶": 1270,
            "高杆": 0,
            "中杆": 0
        }
    },
    "夹子": {
        "马达": [
            {
                "名字": "夹子",
                "端口": 9,
                "正反": 0,
                "齿轮": 1
            }
        ],
        "参数": {
            "悬停值": 7,
            "升到顶": 200
        }
    }
})";
//自定义马达对应值
const int userSpeed[128] = {
    0, 10, 15, 21, 22, 23, 24, 24, 24, 25, 25, 26, 26, 26, 27, 27, 27, 28, 28, 28, 28, 29, 29, 29,
    30, 30, 30, 30, 31, 31, 31, 31, 32, 32, 33, 33, 40, 40, 40, 40, 40, 40, 40, 40, 42, 44, 46, 48,
    50, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 80,
    80, 80, 80, 80, 80, 80, 80, 80, 80, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 100, 100, 100, 100, 100,
    100, 100, 100, 100, 100, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127,
    127, 127, 127, 127, 127, 127, 127, 127};
