#pragma once

#include "dataType.h"
std::string stu = R"({
  "机器人类型": "全能机",
  "队伍编号": "8982B",
  "用户": "sheep",
  "底盘": {
    "马达": [
      {
        "名字": "左前",
        "端口": 1,
        "正反": 0,
        "齿轮": 1
      },
      {
        "名字": "左后",
        "端口": 2,
        "正反": 1,
        "齿轮": 1
      },
      {
        "名字": "右前",
        "端口": 3,
        "正反": 1,
        "齿轮": 1
      },
      {
        "名字": "右后",
        "端口": 4,
        "正反": 0,
        "齿轮": 1
      }
    ],
    "ADI": [ { "陀螺仪": 1 } ],
    "参数": [  ]
  }
})";
const DataConfigList CHASSIS_PRAGMA = { {"马达左前", "1", "0", "绿齿轮"},
									  {"马达左后", "2", "1", "绿齿轮"},
									  {"马达右前", "3", "1", "绿齿轮"},
									  {"马达右后", "4", "0", "绿齿轮"},
										{"陀螺仪比例", "1.0"},   //陀螺仪比例 如果每次转90°实际都没到 则改成0.X 如果每次都超过90 则改成1.X
									   {"左右矫正比例", "1.0"}, // 左右矫正的百分比 如果不左不右=1 如果偏左 就1.1X 如果偏右就0.9X
									   {"左右自瞄速度", "20"},
									   {"遥控器矫正", "10"},
									   {"最大旋转速度", "127"}, //左右自瞄的速度 上限+200
									   {"前后_KP", "0.5"},
									   {"前后_KI", "0.005"},
									   {"前后_KD", "2.0"},
									   {"前后_KBIAS", "0"},
									   {"前后_LIMIT", "100"},
									   {"前后_Q", "0.01"},
									   {"前后_R", "0.02"},
									   {"左右_KP", "0.5"},
									   {"左右_KI", "0.005"},
									   {"左右_KD", "2.0"},
									   {"左右_KBIAS", "0"},
									   {"左右_LIMIT", "100"},
									   {"左右_Q", "0.01"},
									   {"左右_R", "0.02"}}; //左右自瞄的速度 上限+200